ka2_2024/src/Enums/ВидыОсобыхНачисленийИУдержаний/ВидыОсобыхНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОсобыхНачисленийИУдержаний</name>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ДоговорАвторскогоЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ДоговорРаботыУслуги</name>
  </enumValues>
  <enumValues>
    <name>ДСВРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаЗадержкуЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяВыгодаПоЗаймам</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>НачисленоПроцентовПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛЗачтено</name>
  </enumValues>
  <enumValues>
    <name>НДФЛКЗачету</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛРасчетыСБывшимиСотрудниками</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаИзЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьПодарковПризов</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребение</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребениеСотруднику</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышения</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ВидыДоходовИсполнительногоПроизводства/ВидыДоходовИсполнительногоПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоходовИсполнительногоПроизводства</name>
  <enumValues>
    <name>ДоходыБезОграниченияВзысканий</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаВознаграждения</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииНеоблагаемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииОблагаемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииНеоблагаемыеПериодические</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииОблагаемыеПериодические</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииНеоблагаемыеЕдиновременные</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииОблагаемыеЕдиновременные</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ВидыОсобыхНачисленийИУдержаний/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает виды доходов исполнительного производства начислений
// Параметры:
//	Период - дата, на которую необходимо получить виды доходов исполнительного производства.
//
// Возвращаемое значение:
// 	Соответствие:
// 	 	* Ключ     - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний
// 	 	* Значение - ПеречислениеСсылка.ВидыДоходовИсполнительногоПроизводства
// 
Функция ВидыДоходовИсполнительногоПроизводства(Период) Экспорт

	ВидыДоходовИсполнительногоПроизводства = Новый Соответствие;
	
	ВидыДоходов = Перечисления.ВидыДоходовИсполнительногоПроизводства;
	ВидыДоходовИсполнительногоПроизводства.Вставить(Дивиденды,            ВидыДоходов.ДоходыБезОграниченияВзысканий);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДивидендыСотрудников, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДоговорАвторскогоЗаказа, ВидыДоходов.ЗарплатаВознаграждения);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДоговорРаботыУслуги,     ВидыДоходов.ЗарплатаВознаграждения);
	
	ВидыДоходовИсполнительногоПроизводства.Вставить(КомпенсацияЗаЗадержкуЗарплаты, ВидыДоходов.ЗарплатаВознаграждения);
	
	// МатериальнаяВыгодаПоЗаймам не является доходом вообще, в том смысле, 
	// что ИЛ с ее сумм не должны начисляться, и ее НДФЛ можно регистрировать как угодно.
	// Призы проходят в "Перечне видов заработной платы и иного дохода, из которых производится удержание алиментов"
	// в пункте "м) с других видов выплат к заработной плате, установленных законодательством..."
	// Поэтому относим эти виды особых начислений и удержаний к "зарплатным" доходам.
	ВидыДоходовИсполнительногоПроизводства.Вставить(МатериальнаяВыгодаПоЗаймам, ВидыДоходов.ЗарплатаВознаграждения);
	ВидыДоходовИсполнительногоПроизводства.Вставить(СтоимостьПодарковПризов,    ВидыДоходов.ЗарплатаВознаграждения);
	Если ВидыДоходовИсполнительногоПроизводствавызовСервера.ВступилиВСилуИзменения353ФЗ(Период) Тогда
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности, ВидыДоходов.КомпенсацииНеоблагаемые);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриРожденииРебенка,     ВидыДоходов.КомпенсацииНеоблагаемыеЕдиновременные);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребение,           ВидыДоходов.КомпенсацииНеоблагаемыеЕдиновременные);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребениеСотруднику, ВидыДоходов.КомпенсацииНеоблагаемыеЕдиновременные);
	Иначе
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности, ВидыДоходов.КомпенсацииНеоблагаемые);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриРожденииРебенка,     ВидыДоходов.КомпенсацииНеоблагаемые);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребение,           ВидыДоходов.КомпенсацииНеоблагаемые);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребениеСотруднику, ВидыДоходов.КомпенсацииНеоблагаемые);
	КонецЕсли;
	
	Возврат ВидыДоходовИсполнительногоПроизводства
	
КонецФункции

#КонецОбласти

#КонецЕсли
